#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.cert.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:435552912911:certificate/2e6953ea-c466-4ff3-baa9-7e8c3440affa]
module.policy.aws_iam_role.get_average_metrics_lambda_exec_role: Refreshing state... [id=demo_get_average_metrics_lambda_exec_role]
module.policy.aws_iam_role.get_revenue_sum_by_cohort_lambda_exec_role: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_exec_role]
module.policy.aws_iam_role.list_scenarios_lambda_exec_role: Refreshing state... [id=demo_list_scenarios_lambda_exec_role]
module.policy.aws_iam_role.get_cohorts_lambda_exec_role: Refreshing state... [id=demo_get_cohorts_lambda_exec_role]
module.policy.aws_iam_role.get_revenue_sum_by_company_lambda_exec_role: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_exec_role]
module.policy.aws_iam_role.companies_kpi_average_lambda_exec_role: Refreshing state... [id=demo_companies_kpi_average_lambda_exec_role]
module.policy.aws_iam_role_policy_attachment.companies_kpi_average_lambda_vpc: Refreshing state... [id=demo_companies_kpi_average_lambda_exec_role-20211203145959698700000003]
module.functions.aws_lambda_function.get_companies_count_by_size_lambda_function: Refreshing state... [id=demo_get_companies_count_by_size_lambda_function]
module.logs.aws_cloudwatch_log_group.get_companies_kpi_average_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_companies_kpi_average_lambda_function]
module.policy.aws_iam_role_policy_attachment.companies_count_by_size_lambda_logs: Refreshing state... [id=demo_companies_count_by_size_lambda_exec_role-20211203145958636500000001]
module.policy.aws_iam_role.companies_count_by_size_lambda_exec_role: Refreshing state... [id=demo_companies_count_by_size_lambda_exec_role]
module.network.aws_api_gateway_resource.companies_kpi_average: Refreshing state... [id=nzd6kx]
module.network.aws_api_gateway_resource.companies_count_by_size: Refreshing state... [id=8cccuf]
module.network.aws_api_gateway_method.get_companies_count_by_size_method: Refreshing state... [id=agm-kb7gblbu69-8cccuf-GET]
module.network.aws_api_gateway_method.get_companies_kpi_average_method: Refreshing state... [id=agm-kb7gblbu69-nzd6kx-GET]
module.logs.aws_cloudwatch_log_group.get_companies_count_by_size_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_companies_count_by_size_lambda_function]
module.policy.aws_iam_role_policy_attachment.companies_kpi_average_lambda_logs: Refreshing state... [id=demo_companies_kpi_average_lambda_exec_role-20211203145959763300000004]
module.policy.aws_iam_role_policy_attachment.companies_count_by_size_lambda_vpc: Refreshing state... [id=demo_companies_count_by_size_lambda_exec_role-20211203145958636500000002]
module.network.aws_api_gateway_integration.companies_kpi_average_integration: Refreshing state... [id=agi-kb7gblbu69-nzd6kx-GET]
module.buckets.aws_s3_bucket_object.get_companies_kpi_average_function_object: Refreshing state... [id=lambdas/demo/get_companies_kpi_average_handler.zip]
module.functions.aws_lambda_function.get_companies_kpi_average_lambda_function: Refreshing state... [id=demo_get_companies_kpi_average_lambda_function]
module.buckets.aws_s3_bucket_object.get_companies_count_by_size_function_object: Refreshing state... [id=lambdas/demo/get_companies_count_by_size_handler.zip]
module.policy.aws_lambda_permission.apigw_get_companies_kpi_average_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.network.aws_api_gateway_integration.companies_count_by_size_integration: Refreshing state... [id=agi-kb7gblbu69-8cccuf-GET]
module.policy.aws_lambda_permission.apigw_get_companies_count_by_size_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_iam_role.get_company_scenarios_lambda_exec_role: Refreshing state... [id=demo_get_company_scenarios_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_average_metrics_function_object: Refreshing state... [id=lambdas/demo/get_average_metrics_handler.zip]
module.codebuild.aws_codebuild_source_credential.git_credential: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:token/github]
module.policy.aws_iam_role.get_scenarios_lambda_exec_role: Refreshing state... [id=demo_get_scenarios_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_revenue_sum_by_cohort_function_object: Refreshing state... [id=lambdas/demo/get_revenue_sum_by_cohort_handler.zip]
module.policy.aws_iam_role.companies_lambda_exec_role: Refreshing state... [id=demo_companies_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.glue_trigger_lambda_function: Refreshing state... [id=/aws/lambda/demo_glue_trigger_lambda_function]
module.policy.aws_iam_role.company_lambda_exec_role: Refreshing state... [id=demo_company_lambda_exec_role]
module.buckets.aws_s3_bucket_object.list_scenarios_function_object: Refreshing state... [id=lambdas/demo/list_scenarios_handler.zip]
module.logs.aws_cloudwatch_log_group.get_metrics_by_cohort_id_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metrics_by_cohort_id_lambda_function]
module.policy.aws_iam_role.glue_trigger_lambda_exec_role: Refreshing state... [id=demo_glue_trigger_lambda_exec_role]
module.policy.aws_iam_role.get_metrics_lambda_exec_role: Refreshing state... [id=demo_get_metrics_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_cohort_scenarios_function_object: Refreshing state... [id=lambdas/demo/get_cohort_scenarios_handler.zip]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=kb7gblbu69]
module.policy.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_logging_function_back]
module.logs.aws_cloudwatch_log_group.list_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_list_scenarios_lambda_function]
module.buckets.aws_s3_bucket_object.get_average_metrics_by_cohort_function_object: Refreshing state... [id=lambdas/demo/get_average_metrics_by_cohort_handler.zip]
module.logs.aws_cloudwatch_log_group.get_metric_by_id_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metric_by_company_id_lambda_function]
module.buckets.aws_s3_bucket_object.get_metrics_by_cohort_id_function_object: Refreshing state... [id=lambdas/demo/get_metrics_by_cohort_id_handler.zip]
module.policy.aws_iam_role.get_metrics_by_cohort_id_lambda_exec_role: Refreshing state... [id=demo_get_metrics_by_cohort_id_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_company_function_object: Refreshing state... [id=lambdas/demo/get_company_handler.zip]
module.buckets.aws_s3_bucket_object.get_cohort_by_id_function_object: Refreshing state... [id=lambdas/demo/get_cohort_by_id_handler.zip]
module.buckets.aws_s3_bucket_object.get_metrics_function_object: Refreshing state... [id=lambdas/demo/get_metrics_handler.zip]
module.buckets.aws_s3_bucket_object.layer_libraries_object: Refreshing state... [id=layer/demo/layer_libraries.zip]
module.buckets.aws_s3_bucket_object.get_scenarios_function_object: Refreshing state... [id=lambdas/demo/get_scenarios_handler.zip]
module.buckets.aws_s3_bucket_object.get_all_companies_function_object: Refreshing state... [id=lambdas/demo/get_all_companies_handler.zip]
module.logs.aws_cloudwatch_log_group.get_cohort_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_cohort_scenarios_lambda_function]
module.buckets.aws_s3_bucket_object.get_metric_by_company_id_function_object: Refreshing state... [id=lambdas/demo/get_metric_by_company_id_handler.zip]
module.logs.aws_cloudwatch_log_group.get_all_companies_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_all_companies_lambda_function]
module.logs.aws_cloudwatch_log_group.codebuild_rds_migrations: Refreshing state... [id=/aws/codebuild/demo_rds_migrations]
module.logs.aws_cloudwatch_log_group.get_cohorts_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_cohorts_lambda_function]
module.logs.aws_cloudwatch_log_group.get_average_metrics_by_cohort_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_average_metrics_by_cohort_lambda_function]
module.logs.aws_cloudwatch_log_group.get_company_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_lambda_function]
module.buckets.aws_s3_bucket_object.get_cohorts_function_object: Refreshing state... [id=lambdas/demo/get_cohorts_handler.zip]
module.logs.aws_cloudwatch_log_group.get_average_metrics_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_average_metrics_lambda_function]
module.buckets.aws_s3_bucket_object.get_revenue_sum_by_company_function_object: Refreshing state... [id=lambdas/demo/get_revenue_sum_by_company_handler.zip]
module.buckets.aws_s3_bucket_object.get_company_scenarios_function_object: Refreshing state... [id=lambdas/demo/get_company_scenarios_handler.zip]
module.policy.aws_iam_role.get_average_metrics_by_cohort_lambda_exec_role: Refreshing state... [id=demo_get_average_metrics_by_cohort_lambda_exec_role]
module.policy.aws_iam_role.get_cohort_by_id_lambda_exec_role: Refreshing state... [id=demo_get_cohort_by_id_lambda_exec_role]
module.buckets.aws_s3_bucket_object.glue_trigger_function_object: Refreshing state... [id=lambdas/demo/glue_trigger_handler.zip]
module.logs.aws_cloudwatch_log_group.get_metrics_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metrics_lambda_function]
module.policy.aws_iam_policy.lambda_glue_access: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_glue_access]
module.policy.aws_iam_role.get_metric_by_company_id_lambda_exec_role: Refreshing state... [id=demo_get_metric_by_company_id_lambda_exec_role]
aws_route53_zone.kpinetwork: Refreshing state... [id=Z02521762FZPW0IDM8JJO]
module.logs.aws_cloudwatch_log_group.get_company_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_scenarios_lambda_function]
module.logs.aws_cloudwatch_log_group.get_revenue_sum_by_company_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_revenue_sum_by_company_lambda_function]
module.buckets.aws_s3_bucket_object.etl_script_object: Refreshing state... [id=pyspark/kpinetwork_analizer.py]
module.logs.aws_cloudwatch_log_group.get_cohort_by_id_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_cohort_by_id_lambda_function]
module.policy.aws_iam_role.get_cohort_scenarios_lambda_exec_role: Refreshing state... [id=demo_get_cohort_scenarios_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_scenarios_lambda_function]
module.logs.aws_cloudwatch_log_group.get_revenue_sum_by_cohort_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_revenue_sum_by_cohort_lambda_function]
module.network.aws_api_gateway_resource.metrics: Refreshing state... [id=1cyyi4]
module.network.aws_api_gateway_resource.scenarios: Refreshing state... [id=ifcpo2]
module.network.aws_api_gateway_resource.cohorts: Refreshing state... [id=97prpe]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_logs: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916088000000002]
module.network.aws_api_gateway_resource.companies: Refreshing state... [id=bnvar7]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_glue_access: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916085000000001]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_company_lambda_vpc: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_exec_role-20211115215557782000000001]
module.policy.aws_iam_role_policy_attachment.get_metrics_by_cohort_id_lambda_vpc: Refreshing state... [id=demo_get_metrics_by_cohort_id_lambda_exec_role-20211125134234097000000001]
module.policy.aws_iam_role_policy_attachment.company_scenarios_lambda_vpc: Refreshing state... [id=demo_get_company_scenarios_lambda_exec_role-20211111170238922300000004]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_by_cohort_lambda_vpc: Refreshing state... [id=demo_get_average_metrics_by_cohort_lambda_exec_role-20211125134234099900000003]
module.policy.aws_iam_role_policy_attachment.get_metrics_lambda_vpc: Refreshing state... [id=demo_get_metrics_lambda_exec_role-20211110194402192800000001]
module.policy.aws_iam_role_policy_attachment.scenarios_lambda_vpc: Refreshing state... [id=demo_get_scenarios_lambda_exec_role-20211125180844570400000002]
module.policy.aws_iam_role_policy_attachment.company_lambda_vpc: Refreshing state... [id=demo_company_lambda_exec_role-20211104145749000900000003]
module.policy.aws_iam_role_policy_attachment.companies_lambda_vpc: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145748993600000001]
module.policy.aws_iam_role_policy_attachment.list_scenarios_lambda_vpc: Refreshing state... [id=demo_list_scenarios_lambda_exec_role-20211111170238199900000002]
module.policy.aws_iam_role_policy_attachment.get_cohorts_lambda_logs: Refreshing state... [id=demo_get_cohorts_lambda_exec_role-20211116152816576300000002]
module.policy.aws_iam_role_policy_attachment.get_cohort_scenarios_lambda_logs: Refreshing state... [id=demo_get_cohort_scenarios_lambda_exec_role-20211116152817268600000004]
module.policy.aws_iam_role_policy_attachment.companies_lambda_logs: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145749002900000004]
module.sql.aws_db_subnet_group.kpinetwork: Refreshing state... [id=demokpinetwork]
module.policy.aws_iam_role_policy_attachment.list_scenarios_lambda_logs: Refreshing state... [id=demo_list_scenarios_lambda_exec_role-20211111170237751100000001]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_company_lambda_logs: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_exec_role-20211115215557782400000002]
module.policy.aws_iam_role_policy_attachment.get_metric_by_company_id_lambda_logs: Refreshing state... [id=demo_get_metric_by_company_id_lambda_exec_role-20211110195232357400000002]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_cohort_lambda_logs: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_exec_role-20211122220041296600000001]
module.policy.aws_iam_role_policy_attachment.scenarios_lambda_logs: Refreshing state... [id=demo_get_scenarios_lambda_exec_role-20211125180844569300000001]
module.policy.aws_iam_role_policy_attachment.get_metrics_by_cohort_id_lambda_logs: Refreshing state... [id=demo_get_metrics_by_cohort_id_lambda_exec_role-20211125134234575000000004]
module.policy.aws_iam_role_policy_attachment.get_cohort_by_id_lambda_logs: Refreshing state... [id=demo_get_cohort_by_id_lambda_exec_role-20211116152817488400000005]
module.policy.aws_iam_role_policy_attachment.company_scenarios_lambda_logs: Refreshing state... [id=demo_get_company_scenarios_lambda_exec_role-20211111170238921300000003]
module.policy.aws_iam_role_policy_attachment.get_cohorts_lambda_vpc: Refreshing state... [id=demo_get_cohorts_lambda_exec_role-20211116152816484600000001]
module.policy.aws_iam_role_policy_attachment.get_cohort_scenarios_lambda_vpc: Refreshing state... [id=demo_get_cohort_scenarios_lambda_exec_role-20211116152817033600000003]
module.policy.aws_iam_role_policy_attachment.get_metrics_lambda_logs: Refreshing state... [id=demo_get_metrics_lambda_exec_role-20211110194402226000000002]
module.policy.aws_iam_role_policy_attachment.company_lambda_logs: Refreshing state... [id=demo_company_lambda_exec_role-20211104145749000100000002]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_cohort_lambda_vpc: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_exec_role-20211122220041371600000002]
module.policy.aws_iam_role_policy_attachment.get_metric_by_id_lambda_vpc: Refreshing state... [id=demo_get_metric_by_company_id_lambda_exec_role-20211110195232341900000001]
module.policy.aws_iam_role_policy_attachment.get_cohort_by_id_lambda_vpc: Refreshing state... [id=demo_get_cohort_by_id_lambda_exec_role-20211116152817567900000006]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_lambda_vpc: Refreshing state... [id=demo_get_average_metrics_lambda_exec_role-20211122220041443600000003]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_by_cohort_lambda_logs: Refreshing state... [id=demo_get_average_metrics_by_cohort_lambda_exec_role-20211125134234098900000002]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_lambda_logs: Refreshing state... [id=demo_get_average_metrics_lambda_exec_role-20211122220041624400000004]
module.dns.aws_route53_record.cert_validations[0]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment: Refreshing state... [id=i6ct48]
module.dns.aws_route53_record.cert_validations[1]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.network.aws_api_gateway_resource.company_metric: Refreshing state... [id=2ty0vw]
module.network.aws_api_gateway_method.get_metrics_method: Refreshing state... [id=agm-kb7gblbu69-1cyyi4-GET]
module.network.aws_api_gateway_resource.metric_cohort: Refreshing state... [id=fjgqv3]
module.network.aws_api_gateway_resource.scenarios_list: Refreshing state... [id=tp2zxu]
module.network.aws_api_gateway_resource.scenario_company: Refreshing state... [id=z01lfb]
module.network.aws_api_gateway_method.get_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-ifcpo2-GET]
module.network.aws_api_gateway_resource.cohort_revenue: Refreshing state... [id=pymy9y]
module.network.aws_api_gateway_method.get_cohorts_method: Refreshing state... [id=agm-kb7gblbu69-97prpe-GET]
module.network.aws_api_gateway_resource.cohort: Refreshing state... [id=5k8zew]
module.network.aws_api_gateway_method.get_all_companies_method: Refreshing state... [id=agm-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_resource.company_revenue: Refreshing state... [id=cl0jnm]
module.network.aws_api_gateway_resource.company: Refreshing state... [id=sjvaet]
module.functions.aws_lambda_layer_version.db_lambda_layer: Refreshing state... [id=arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:4]
module.functions.aws_lambda_function.glue_trigger_lambda_function: Refreshing state... [id=demo_glue_trigger_lambda_function]
module.network.aws_api_gateway_resource.metric_cohort_id: Refreshing state... [id=rr716m]
module.network.aws_api_gateway_resource.metric: Refreshing state... [id=k9hbzo]
module.network.aws_api_gateway_resource.scenarios_company_id: Refreshing state... [id=znsrwp]
module.network.aws_api_gateway_method.list_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-tp2zxu-GET]
module.cert.aws_acm_certificate_validation.cert: Refreshing state... [id=2021-10-15 14:52:46 +0000 UTC]
module.sql.aws_db_instance.kpinetwork_db: Refreshing state... [id=demokpinetworkdb]
module.network.aws_api_gateway_method.get_revenue_sum_by_cohort_method: Refreshing state... [id=agm-kb7gblbu69-pymy9y-GET]
module.network.aws_api_gateway_resource.cohort_scenarios: Refreshing state... [id=63z04b]
module.network.aws_api_gateway_method.get_cohort_by_id_method: Refreshing state... [id=agm-kb7gblbu69-5k8zew-GET]
module.network.aws_api_gateway_method.get_company_method: Refreshing state... [id=agm-kb7gblbu69-sjvaet-GET]
module.network.aws_api_gateway_method.get_revenue_sum_by_company_method: Refreshing state... [id=agm-kb7gblbu69-cl0jnm-GET]
module.network.aws_api_gateway_resource.cohort_average_metric: Refreshing state... [id=hdyvp6]
module.network.aws_api_gateway_resource.cohort_metrics: Refreshing state... [id=rtzpd4]
module.network.aws_api_gateway_method.get_company_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-znsrwp-GET]
module.network.aws_api_gateway_method.get_metric_by_company_id_method: Refreshing state... [id=agm-kb7gblbu69-k9hbzo-GET]
module.network.aws_api_gateway_resource.average_metrics: Refreshing state... [id=ww2zcl]
module.network.aws_api_gateway_domain_name.domain: Refreshing state... [id=api.demo.kpinetwork.com]
module.network.aws_api_gateway_method.get_cohort_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-63z04b-GET]
module.network.aws_api_gateway_method.get_average_metrics_by_cohort_method: Refreshing state... [id=agm-kb7gblbu69-hdyvp6-GET]
module.network.aws_api_gateway_method.get_metrics_by_cohort_id_method: Refreshing state... [id=agm-kb7gblbu69-rtzpd4-GET]
module.network.aws_api_gateway_method.get_average_metrics_method: Refreshing state... [id=agm-kb7gblbu69-ww2zcl-GET]
module.network.aws_api_gateway_base_path_mapping.domain_mapping: Refreshing state... [id=api.demo.kpinetwork.com/]
module.dns.aws_route53_record.kpinetwork_domain: Refreshing state... [id=Z02521762FZPW0IDM8JJO_api.demo.kpinetwork.com_A]
module.functions.aws_lambda_permission.glue_trigger_event_permission: Refreshing state... [id=AllowExecutionFromS3Bucket]
module.codebuild.aws_codebuild_project.rds_migrations: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:project/demo_rds_migrations]
module.functions.aws_lambda_function.get_company_scenarios_lambda_function: Refreshing state... [id=demo_get_company_scenarios_lambda_function]
module.functions.aws_lambda_function.get_company_lambda_function: Refreshing state... [id=demo_get_company_lambda_function]
module.functions.aws_lambda_function.get_cohort_by_id_function: Refreshing state... [id=demo_get_cohort_by_id_lambda_function]
module.functions.aws_lambda_function.get_cohorts_scenarios_function: Refreshing state... [id=demo_get_cohort_scenarios_lambda_function]
module.functions.aws_lambda_function.get_average_metrics_function: Refreshing state... [id=demo_get_average_metrics_lambda_function]
module.functions.aws_lambda_function.get_cohorts_function: Refreshing state... [id=demo_get_cohorts_lambda_function]
module.functions.aws_lambda_function.get_all_companies_lambda_function: Refreshing state... [id=demo_get_all_companies_lambda_function]
module.functions.aws_lambda_function.get_average_metrics_by_cohort_function: Refreshing state... [id=demo_get_average_metrics_by_cohort_lambda_function]
module.functions.aws_lambda_function.get_metric_by_company_id_function: Refreshing state... [id=demo_get_metric_by_company_id_lambda_function]
module.functions.aws_lambda_function.list_scenarios_lambda_function: Refreshing state... [id=demo_list_scenarios_lambda_function]
module.functions.aws_lambda_function.get_revenue_sum_by_cohort_lambda_function: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_function]
module.functions.aws_lambda_function.get_metrics_by_cohort_id_function: Refreshing state... [id=demo_get_metrics_by_cohort_id_lambda_function]
module.functions.aws_lambda_function.get_revenue_sum_by_company_lambda_function: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_function]
module.functions.aws_lambda_function.get_metrics_function: Refreshing state... [id=demo_get_metrics_lambda_function]
module.functions.aws_s3_bucket_notification.files_bucket_notification: Refreshing state... [id=kpinetwork-files]
module.functions.aws_lambda_function.get_scenarios_lambda_function: Refreshing state... [id=demo_get_scenarios_lambda_function]
module.policy.aws_lambda_permission.apigw_get_company_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_all_companies_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetScenarios]
module.policy.aws_lambda_permission.apigw_get_metrics_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_revenue_sum_by_company_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRevenueSum]
module.policy.aws_lambda_permission.apigw_get_cohorts_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_metrics_by_cohort_id_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCohortId]
module.policy.aws_lambda_permission.apigw_get_average_metrics_by_cohort_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCohortAverage]
module.policy.aws_lambda_permission.apigw_get_cohort_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_cohort_by_id_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_metric_by_company_id_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_average_metrics_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayAverage]
module.policy.aws_lambda_permission.apigw_get_company_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetCompanyScenarios]
module.policy.aws_lambda_permission.apigw_list_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayListScenarios]
module.policy.aws_lambda_permission.apigw_get_revenue_sum_by_cohort_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRevenueSum]
module.network.aws_api_gateway_integration.company_scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-znsrwp-GET]
module.network.aws_api_gateway_integration.companies_integration: Refreshing state... [id=agi-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_integration.cohort_average_metrics_integration: Refreshing state... [id=agi-kb7gblbu69-hdyvp6-GET]
module.network.aws_api_gateway_integration.company_integration: Refreshing state... [id=agi-kb7gblbu69-sjvaet-GET]
module.network.aws_api_gateway_integration.revenue_sum_by_cohort_integration: Refreshing state... [id=agi-kb7gblbu69-pymy9y-GET]
module.network.aws_api_gateway_integration.cohorts_integration: Refreshing state... [id=agi-kb7gblbu69-97prpe-GET]
module.network.aws_api_gateway_integration.cohort_by_id_integration: Refreshing state... [id=agi-kb7gblbu69-5k8zew-GET]
module.network.aws_api_gateway_integration.metric_by_company_id_integration: Refreshing state... [id=agi-kb7gblbu69-k9hbzo-GET]
module.network.aws_api_gateway_integration.average_metrics_integration: Refreshing state... [id=agi-kb7gblbu69-ww2zcl-GET]
module.network.aws_api_gateway_integration.metrics_by_cohort_id_integration: Refreshing state... [id=agi-kb7gblbu69-rtzpd4-GET]
module.network.aws_api_gateway_integration.metrics_integration: Refreshing state... [id=agi-kb7gblbu69-1cyyi4-GET]
module.network.aws_api_gateway_integration.revenue_sum_by_company_integration: Refreshing state... [id=agi-kb7gblbu69-cl0jnm-GET]
module.network.aws_api_gateway_integration.scenarios_list_integration: Refreshing state... [id=agi-kb7gblbu69-tp2zxu-GET]
module.network.aws_api_gateway_integration.scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-ifcpo2-GET]
module.network.aws_api_gateway_integration.cohort_scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-63z04b-GET]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.buckets.aws_s3_bucket_object.get_companies_kpi_average_function_object has been changed
  ~ resource "aws_s3_bucket_object" "get_companies_kpi_average_function_object" {
        id                 = "lambdas/demo/get_companies_kpi_average_handler.zip"
      + metadata           = {}
      + tags               = {}
        # (10 unchanged attributes hidden)
    }
  # module.buckets.aws_s3_bucket_object.get_companies_count_by_size_function_object has been changed
  ~ resource "aws_s3_bucket_object" "get_companies_count_by_size_function_object" {
        id                 = "lambdas/demo/get_companies_count_by_size_handler.zip"
      + metadata           = {}
      + tags               = {}
        # (10 unchanged attributes hidden)
    }
  # module.logs.aws_cloudwatch_log_group.get_companies_kpi_average_lambda_function has been changed
  ~ resource "aws_cloudwatch_log_group" "get_companies_kpi_average_lambda_function" {
        id                = "/aws/lambda/demo_get_companies_kpi_average_lambda_function"
        name              = "/aws/lambda/demo_get_companies_kpi_average_lambda_function"
      + tags              = {}
        # (3 unchanged attributes hidden)
    }
  # module.logs.aws_cloudwatch_log_group.get_companies_count_by_size_lambda_function has been changed
  ~ resource "aws_cloudwatch_log_group" "get_companies_count_by_size_lambda_function" {
        id                = "/aws/lambda/demo_get_companies_count_by_size_lambda_function"
        name              = "/aws/lambda/demo_get_companies_count_by_size_lambda_function"
      + tags              = {}
        # (3 unchanged attributes hidden)
    }
  # module.network.aws_api_gateway_method.get_companies_kpi_average_method has been changed
  ~ resource "aws_api_gateway_method" "get_companies_kpi_average_method" {
      + authorization_scopes = []
        id                   = "agm-kb7gblbu69-nzd6kx-GET"
      + request_models       = {}
        # (6 unchanged attributes hidden)
    }
  # module.network.aws_api_gateway_integration.companies_kpi_average_integration has been changed
  ~ resource "aws_api_gateway_integration" "companies_kpi_average_integration" {
      + cache_key_parameters    = []
        id                      = "agi-kb7gblbu69-nzd6kx-GET"
      + request_parameters      = {}
      + request_templates       = {}
        # (10 unchanged attributes hidden)
    }
  # module.network.aws_api_gateway_method.get_companies_count_by_size_method has been changed
  ~ resource "aws_api_gateway_method" "get_companies_count_by_size_method" {
      + authorization_scopes = []
        id                   = "agm-kb7gblbu69-8cccuf-GET"
      + request_models       = {}
        # (6 unchanged attributes hidden)
    }
  # module.network.aws_api_gateway_integration.companies_count_by_size_integration has been changed
  ~ resource "aws_api_gateway_integration" "companies_count_by_size_integration" {
      + cache_key_parameters    = []
        id                      = "agi-kb7gblbu69-8cccuf-GET"
      + request_parameters      = {}
      + request_templates       = {}
        # (10 unchanged attributes hidden)
    }
  # module.policy.aws_iam_role.companies_kpi_average_lambda_exec_role has been changed
  ~ resource "aws_iam_role" "companies_kpi_average_lambda_exec_role" {
        id                    = "demo_companies_kpi_average_lambda_exec_role"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function",
          + "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function",
        ]
        name                  = "demo_companies_kpi_average_lambda_exec_role"
      + tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.policy.aws_iam_role.companies_count_by_size_lambda_exec_role has been changed
  ~ resource "aws_iam_role" "companies_count_by_size_lambda_exec_role" {
        id                    = "demo_companies_count_by_size_lambda_exec_role"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function",
          + "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function",
        ]
        name                  = "demo_companies_count_by_size_lambda_exec_role"
      + tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.functions.aws_lambda_function.get_companies_kpi_average_lambda_function has been changed
  ~ resource "aws_lambda_function" "get_companies_kpi_average_lambda_function" {
        id                             = "demo_get_companies_kpi_average_lambda_function"
      + tags                           = {}
        # (26 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # module.functions.aws_lambda_function.get_companies_count_by_size_lambda_function has been changed
  ~ resource "aws_lambda_function" "get_companies_count_by_size_lambda_function" {
        id                             = "demo_get_companies_count_by_size_lambda_function"
      + tags                           = {}
        # (26 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "fa214c46e4a5c9da8c3b7d54d6ea5fbb" -> "ea70115e5d2113047b689043c33997f0"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_average_metrics_by_cohort_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_average_metrics_by_cohort_function_object" {
      ~ etag               = "7389960460c7574eb30dae1105048b3a" -> "f959cc2663b95c0f483ec0563edd0110"
        id                 = "lambdas/demo/get_average_metrics_by_cohort_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_average_metrics_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_average_metrics_function_object" {
      ~ etag               = "9102f8e9a0a14090cc85aabd9ee768bc" -> "137a6681a66d4709de66f953ff1e31a6"
        id                 = "lambdas/demo/get_average_metrics_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_cohort_by_id_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_cohort_by_id_function_object" {
      ~ etag               = "a062d81af5eaaa82b0cf53550e29c5df" -> "0acfb5f33867c0b4b6a28810f8f6a0c4"
        id                 = "lambdas/demo/get_cohort_by_id_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_cohort_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_cohort_scenarios_function_object" {
      ~ etag               = "93b29470b949ba404531e030b5b7f989" -> "1b54bad447fbc3fa1655f32898cc37fa"
        id                 = "lambdas/demo/get_cohort_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_cohorts_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_cohorts_function_object" {
      ~ etag               = "98d984693ec4ac317032d49a6599bf34" -> "aae484fc4710ea7cd7bbaf8fa020109d"
        id                 = "lambdas/demo/get_cohorts_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_companies_count_by_size_function_object will be destroyed
  - resource "aws_s3_bucket_object" "get_companies_count_by_size_function_object" {
      - acl                = "private" -> null
      - bucket             = "kpinetwork-backend" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "24450386c3bf5fc987353f595ffc66f4" -> null
      - force_destroy      = false -> null
      - id                 = "lambdas/demo/get_companies_count_by_size_handler.zip" -> null
      - key                = "lambdas/demo/get_companies_count_by_size_handler.zip" -> null
      - metadata           = {} -> null
      - source             = "buckets/../../dist/get_companies_count_by_size_handler.zip" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.buckets.aws_s3_bucket_object.get_companies_kpi_average_function_object will be destroyed
  - resource "aws_s3_bucket_object" "get_companies_kpi_average_function_object" {
      - acl                = "private" -> null
      - bucket             = "kpinetwork-backend" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "ff93f32a1fb4a89b4bef4326e3cee533" -> null
      - force_destroy      = false -> null
      - id                 = "lambdas/demo/get_companies_kpi_average_handler.zip" -> null
      - key                = "lambdas/demo/get_companies_kpi_average_handler.zip" -> null
      - metadata           = {} -> null
      - source             = "buckets/../../dist/get_companies_kpi_average_handler.zip" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.buckets.aws_s3_bucket_object.get_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_function_object" {
      ~ etag               = "d371ac20629ee8adb4e058330fd9f7ad" -> "7bb0a0e78a968aca802e8d984b52cbd0"
        id                 = "lambdas/demo/get_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_scenarios_function_object" {
      ~ etag               = "1522168bd4537f811b19ca686df3b7f2" -> "c3a245cb0c483e948092ffcaef348ca9"
        id                 = "lambdas/demo/get_company_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_growth_and_margin_function_object will be created
  + resource "aws_s3_bucket_object" "get_growth_and_margin_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "65adc3f8fc68eabdd65e8a8ee9ba9e95"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/get_growth_and_margin_hanlder.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/get_growth_and_margin_hanlder.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_by_company_id_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_by_company_id_function_object" {
      ~ etag               = "ee12abd0a3ae3da99e3e463feef362a0" -> "5a8bee5d46758b8b37880ffe6a2410ae"
        id                 = "lambdas/demo/get_metric_by_company_id_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metrics_by_cohort_id_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metrics_by_cohort_id_function_object" {
      ~ etag               = "39f3d7bb4c148bcc038dea2a87f82cea" -> "8ba2ebf2a96e55a2c42886718bfef9d0"
        id                 = "lambdas/demo/get_metrics_by_cohort_id_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metrics_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metrics_function_object" {
      ~ etag               = "8d1bf00f4627fa28c8ce7c1d9b72e0e0" -> "74308c9f635012bf491e61d4e95c4823"
        id                 = "lambdas/demo/get_metrics_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_revenue_sum_by_cohort_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_revenue_sum_by_cohort_function_object" {
      ~ etag               = "eacc1f639d5066cad41abca7f1968a3b" -> "dc1409675e65ea471750c80e3e20e27e"
        id                 = "lambdas/demo/get_revenue_sum_by_cohort_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_revenue_sum_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_revenue_sum_by_company_function_object" {
      ~ etag               = "47f9f8044f549f462340ea21558f46aa" -> "41c414d8bf4e0844cc9f980d0a29a275"
        id                 = "lambdas/demo/get_revenue_sum_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_scenarios_function_object" {
      ~ etag               = "0ed630fa853c0711dfbc4dc40a413fc2" -> "62dce6d420ee0633eb2d09510cd30bd9"
        id                 = "lambdas/demo/get_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "dbaa380da196a0ff50f747dfac2fe5b2" -> "480037db586cf68501a004298a7bce1c"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "ab791866c9b0174f7c727249cee45e18" -> "e07036278f9662ea6ca8b084c97445a8"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.list_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "list_scenarios_function_object" {
      ~ etag               = "eaa82744792e5124075dcb4ae2b531da" -> "2b53f3b15e402ffa63e0ba37523a448a"
        id                 = "lambdas/demo/list_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2021-12-03T15:00:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "93gfOKSIxGJNJzXNU1Gjo0TlbTwGIQKaT9hb3fAIMho=" -> "xZm4nAXNlBZDRwi9hpVHBg5mijqOn0nVipd5eksNqZA="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_average_metrics_by_cohort_function will be updated in-place
  ~ resource "aws_lambda_function" "get_average_metrics_by_cohort_function" {
        id                             = "demo_get_average_metrics_by_cohort_lambda_function"
      ~ last_modified                  = "2021-12-03T15:00:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "HiAjeB5NG1NIsEXte9OjDhTj5go0/vnqKlsiqTcOKUY=" -> "yGRWzvChxFzX0jmLUlOewh7+5amr5SaEevk6j35pO1c="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_average_metrics_function will be updated in-place
  ~ resource "aws_lambda_function" "get_average_metrics_function" {
        id                             = "demo_get_average_metrics_lambda_function"
      ~ last_modified                  = "2021-12-03T15:00:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "bmBpDn74/9P9fVBkt9D4h3HeOlNwq18eWn/upqbouoE=" -> "ixFj3r0/ts0htZV2RvZRg+A5u0IaffVL18BOVrp3QuY="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_cohort_by_id_function will be updated in-place
  ~ resource "aws_lambda_function" "get_cohort_by_id_function" {
        id                             = "demo_get_cohort_by_id_lambda_function"
      ~ last_modified                  = "2021-12-03T15:00:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "Q2By6KQ8/Ra7uvVlaqNK/YANzkQ5xo1alu23vf4S+hs=" -> "+JHN/EWzxKTPoCBr9SzAeIqfC2+ZYowGLmhItGivmjc="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_cohorts_function will be updated in-place
  ~ resource "aws_lambda_function" "get_cohorts_function" {
        id                             = "demo_get_cohorts_lambda_function"
      ~ last_modified                  = "2021-12-03T15:01:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "biebCArjlJyphl4MF+0nJoie83s+WUpoRy3ZLlXWFYc=" -> "9WmDmeYX1w/N6qKwhe0N03pLeTtdnielC1Lqjjxov2c="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_cohorts_scenarios_function will be updated in-place
  ~ resource "aws_lambda_function" "get_cohorts_scenarios_function" {
        id                             = "demo_get_cohort_scenarios_lambda_function"
      ~ last_modified                  = "2021-12-03T15:01:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "zOI4+9zFdpxYvFbqhICOyud0tNMspKkZbVd4BuL4KLU=" -> "T0BG1LBOHNcPsa1ujErjOqZuhLhAWJQaczNSwRBy/rQ="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_companies_count_by_size_lambda_function will be destroyed
  - resource "aws_lambda_function" "get_companies_count_by_size_lambda_function" {
      - arn                            = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_companies_count_by_size_lambda_function" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - function_name                  = "demo_get_companies_count_by_size_lambda_function" -> null
      - handler                        = "get_companies_count_by_size_handler.handler" -> null
      - id                             = "demo_get_companies_count_by_size_lambda_function" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_companies_count_by_size_lambda_function/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2021-12-03T15:00:52.977+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:4",
        ] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_companies_count_by_size_lambda_function:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::435552912911:role/demo_companies_count_by_size_lambda_exec_role" -> null
      - runtime                        = "python3.6" -> null
      - s3_bucket                      = "kpinetwork-backend" -> null
      - s3_key                         = "lambdas/demo/get_companies_count_by_size_handler.zip" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "QODNm64NRnYAA0sU4Idlnq+HK9EHyRnsvkqQeOHSDRg=" -> null
      - source_code_size               = 4527 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "DB_HOST"     = (sensitive)
              - "DB_NAME"     = "demokpinetworkdb"
              - "DB_PASSWORD" = (sensitive)
              - "DB_USERNAME" = (sensitive)
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - security_group_ids = [
              - "sg-0bda66e4a9afc62a9",
            ] -> null
          - subnet_ids         = [
              - "subnet-0b0383c09324099c1",
            ] -> null
          - vpc_id             = "vpc-0f621b75ad71aa17d" -> null
        }
    }

  # module.functions.aws_lambda_function.get_companies_kpi_average_lambda_function will be destroyed
  - resource "aws_lambda_function" "get_companies_kpi_average_lambda_function" {
      - arn                            = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_companies_kpi_average_lambda_function" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - function_name                  = "demo_get_companies_kpi_average_lambda_function" -> null
      - handler                        = "get_companies_kpi_average_handler.handler" -> null
      - id                             = "demo_get_companies_kpi_average_lambda_function" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_companies_kpi_average_lambda_function/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2021-12-03T15:00:53.055+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:4",
        ] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_companies_kpi_average_lambda_function:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::435552912911:role/demo_companies_kpi_average_lambda_exec_role" -> null
      - runtime                        = "python3.6" -> null
      - s3_bucket                      = "kpinetwork-backend" -> null
      - s3_key                         = "lambdas/demo/get_companies_kpi_average_handler.zip" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "3eoy7Ol/twNoNnByPd23cHl0XRcg6kh5ivnnTVDZwlw=" -> null
      - source_code_size               = 4613 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "DB_HOST"     = (sensitive)
              - "DB_NAME"     = "demokpinetworkdb"
              - "DB_PASSWORD" = (sensitive)
              - "DB_USERNAME" = (sensitive)
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - security_group_ids = [
              - "sg-0bda66e4a9afc62a9",
            ] -> null
          - subnet_ids         = [
              - "subnet-0b0383c09324099c1",
            ] -> null
          - vpc_id             = "vpc-0f621b75ad71aa17d" -> null
        }
    }

  # module.functions.aws_lambda_function.get_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_lambda_function" {
        id                             = "demo_get_company_lambda_function"
      ~ last_modified                  = "2021-12-03T15:00:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "ooWkX2ydWbZSZ8qQR/mZVZo6Li3hylIQmho/A66Urzc=" -> "mX/DGWi8v91OfQjfLTzpv9hi8i2LRaU50DdAMgJThXo="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_scenarios_lambda_function" {
        id                             = "demo_get_company_scenarios_lambda_function"
      ~ last_modified                  = "2021-12-03T15:01:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "8NRkfU4Pcf/VewkxzSSAWQP447ORwMEEdotQkWQA4UQ=" -> "wAByvJjFSi0qnjwecCtwDZU8XcR2O1Ofg3esaV9oQ+w="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_growth_and_margin_lambda_function will be created
  + resource "aws_lambda_function" "get_growth_and_margin_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_get_growth_and_margin_lambda_function"
      + handler                        = "get_growth_and_margin_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:4",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.6"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/get_growth_and_margin_hanlder.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "7qfGnXmH/axSrwZ/XC7gbL0fGOv20j8ypUP/jQPP/rs="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_HOST"     = (sensitive)
              + "DB_NAME"     = "demokpinetworkdb"
              + "DB_PASSWORD" = (sensitive)
              + "DB_USERNAME" = (sensitive)
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0b0383c09324099c1",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.get_metric_by_company_id_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_by_company_id_function" {
        id                             = "demo_get_metric_by_company_id_lambda_function"
      ~ last_modified                  = "2021-12-03T15:00:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "yhJKgdwDD6AmKqryABHRdqyNfy2r9uyqCQUX0AZNk+w=" -> "gNUsckCrkZ8nundmUSZD/Iu1tVcOoKAnS9MTXXJnoNA="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metrics_by_cohort_id_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metrics_by_cohort_id_function" {
        id                             = "demo_get_metrics_by_cohort_id_lambda_function"
      ~ last_modified                  = "2021-12-03T15:00:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "RIjWG7NtJRIblhb4Dnei5J2/COx/mW2r4T/38axkw9Y=" -> "4jDBpfOPF0OxtbHhGSvqzeVYp/mkYAPyqt7QJbjhdSE="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metrics_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metrics_function" {
        id                             = "demo_get_metrics_lambda_function"
      ~ last_modified                  = "2021-12-03T15:01:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "Zfv2aPcXyXjQ3ZxBoGrB5kQTaSpsYFLIMoxf+37xDbE=" -> "V0gISn9DwTRWExttqdtrE1nFqffoNLbnHyL3RbkzaK0="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_revenue_sum_by_cohort_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_revenue_sum_by_cohort_lambda_function" {
        id                             = "demo_get_revenue_sum_by_cohort_lambda_function"
      ~ last_modified                  = "2021-12-03T15:00:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "IwgrByitsG6TssHcMekiO/jkS2kc6izSKd5s+XThD60=" -> "jtpWKETYl4wQiiQamM0R8/byBSGmf3C5lpBQXav0DdQ="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_revenue_sum_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_revenue_sum_by_company_lambda_function" {
        id                             = "demo_get_revenue_sum_by_company_lambda_function"
      ~ last_modified                  = "2021-12-03T15:01:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "T35o6H5V6l6/A3jBP58b9SQJBqSf5KoP6gbW1Mynda4=" -> "4HALCrJ2BQSI9xu83RhCL8RotqHExYO4k07lXIRSDBg="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_scenarios_lambda_function" {
        id                             = "demo_get_scenarios_lambda_function"
      ~ last_modified                  = "2021-12-03T15:01:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "46P6H7uRTPnuRD8Gw7iqQtjDQeL+t6VhpgaXgmafVGs=" -> "VanxGO0zGtteaY/Ck79TI2bVKJnafB1a8lYyxkmyswQ="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2021-12-03T15:01:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "SAiIImVh7/3keeCuP9lTZMB6BDefZi0U/COLb5Qhivk=" -> "iD9SjBqOSrAR6tSr2PhPsT0Zva0nUEydI69VNFKj5c4="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.list_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "list_scenarios_lambda_function" {
        id                             = "demo_list_scenarios_lambda_function"
      ~ last_modified                  = "2021-12-03T15:01:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "E1MoWBNkPLs7gT/fOQBW+unfQJ52PZbPYYqn6Kydokk=" -> "x+g1ZkvBvtAprlEy0Yoz9Q7hvo2ESPFLLTtNjoPYwIU="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2021-12-03T14:59:57Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "i6ct48" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at d 2021-12-03T14:59:55Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.logs.aws_cloudwatch_log_group.get_companies_count_by_size_lambda_function will be destroyed
  - resource "aws_cloudwatch_log_group" "get_companies_count_by_size_lambda_function" {
      - arn               = "arn:aws:logs:us-west-2:435552912911:log-group:/aws/lambda/demo_get_companies_count_by_size_lambda_function" -> null
      - id                = "/aws/lambda/demo_get_companies_count_by_size_lambda_function" -> null
      - name              = "/aws/lambda/demo_get_companies_count_by_size_lambda_function" -> null
      - retention_in_days = 14 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.logs.aws_cloudwatch_log_group.get_companies_kpi_average_lambda_function will be destroyed
  - resource "aws_cloudwatch_log_group" "get_companies_kpi_average_lambda_function" {
      - arn               = "arn:aws:logs:us-west-2:435552912911:log-group:/aws/lambda/demo_get_companies_kpi_average_lambda_function" -> null
      - id                = "/aws/lambda/demo_get_companies_kpi_average_lambda_function" -> null
      - name              = "/aws/lambda/demo_get_companies_kpi_average_lambda_function" -> null
      - retention_in_days = 14 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.logs.aws_cloudwatch_log_group.get_growth_and_margin_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "get_growth_and_margin_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_get_growth_and_margin_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.network.aws_api_gateway_integration.companies_count_by_size_integration will be destroyed
  - resource "aws_api_gateway_integration" "companies_count_by_size_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "8cccuf" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-kb7gblbu69-8cccuf-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "8cccuf" -> null
      - rest_api_id             = "kb7gblbu69" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_companies_count_by_size_lambda_function/invocations" -> null
    }

  # module.network.aws_api_gateway_integration.companies_kpi_average_integration will be destroyed
  - resource "aws_api_gateway_integration" "companies_kpi_average_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "nzd6kx" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-kb7gblbu69-nzd6kx-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "nzd6kx" -> null
      - rest_api_id             = "kb7gblbu69" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_companies_kpi_average_lambda_function/invocations" -> null
    }

  # module.network.aws_api_gateway_integration.growth_and_margin_integration will be created
  + resource "aws_api_gateway_integration" "growth_and_margin_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_method.get_companies_count_by_size_method will be destroyed
  - resource "aws_api_gateway_method" "get_companies_count_by_size_method" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-kb7gblbu69-8cccuf-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {
          - "method.request.querystring.sector"   = false
          - "method.request.querystring.vertical" = false
        } -> null
      - resource_id          = "8cccuf" -> null
      - rest_api_id          = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_method.get_companies_kpi_average_method will be destroyed
  - resource "aws_api_gateway_method" "get_companies_kpi_average_method" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-kb7gblbu69-nzd6kx-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {
          - "method.request.querystring.metric"        = false
          - "method.request.querystring.scenario_type" = false
          - "method.request.querystring.sector"        = false
          - "method.request.querystring.vertical"      = false
          - "method.request.querystring.year"          = false
        } -> null
      - resource_id          = "nzd6kx" -> null
      - rest_api_id          = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_method.get_growth_and_margin_method will be created
  + resource "aws_api_gateway_method" "get_growth_and_margin_method" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.querystring.sector"   = false
          + "method.request.querystring.vertical" = false
          + "method.request.querystring.year"     = false
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_resource.companies_count_by_size will be destroyed
  - resource "aws_api_gateway_resource" "companies_count_by_size" {
      - id          = "8cccuf" -> null
      - parent_id   = "bnvar7" -> null
      - path        = "/companies/count-by-size" -> null
      - path_part   = "count-by-size" -> null
      - rest_api_id = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_resource.companies_kpi_average will be destroyed
  - resource "aws_api_gateway_resource" "companies_kpi_average" {
      - id          = "nzd6kx" -> null
      - parent_id   = "bnvar7" -> null
      - path        = "/companies/kpi-average" -> null
      - path_part   = "kpi-average" -> null
      - rest_api_id = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_resource.growth_and_margin will be created
  + resource "aws_api_gateway_resource" "growth_and_margin" {
      + id          = (known after apply)
      + parent_id   = "bnvar7"
      + path        = (known after apply)
      + path_part   = "growth_and_margin"
      + rest_api_id = "kb7gblbu69"
    }

  # module.policy.aws_iam_role.companies_count_by_size_lambda_exec_role will be destroyed
  - resource "aws_iam_role" "companies_count_by_size_lambda_exec_role" {
      - arn                   = "arn:aws:iam::435552912911:role/demo_companies_count_by_size_lambda_exec_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-12-03T14:59:53Z" -> null
      - description           = "Allows Lambda Function to call AWS services on your behalf." -> null
      - force_detach_policies = false -> null
      - id                    = "demo_companies_count_by_size_lambda_exec_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function",
          - "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "demo_companies_count_by_size_lambda_exec_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAWK2H2AYHQTPKU6DZU" -> null

      - inline_policy {}
    }

  # module.policy.aws_iam_role.companies_kpi_average_lambda_exec_role will be destroyed
  - resource "aws_iam_role" "companies_kpi_average_lambda_exec_role" {
      - arn                   = "arn:aws:iam::435552912911:role/demo_companies_kpi_average_lambda_exec_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-12-03T14:59:54Z" -> null
      - description           = "Allows Lambda Function to call AWS services on your behalf." -> null
      - force_detach_policies = false -> null
      - id                    = "demo_companies_kpi_average_lambda_exec_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function",
          - "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "demo_companies_kpi_average_lambda_exec_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAWK2H2AYHXFO4STSRL" -> null

      - inline_policy {}
    }

  # module.policy.aws_iam_role.get_growth_and_margin_lambda_exec_role will be created
  + resource "aws_iam_role" "get_growth_and_margin_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo_get_growth_and_margin_id_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role_policy_attachment.companies_count_by_size_lambda_logs will be destroyed
  - resource "aws_iam_role_policy_attachment" "companies_count_by_size_lambda_logs" {
      - id         = "demo_companies_count_by_size_lambda_exec_role-20211203145958636500000001" -> null
      - policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function" -> null
      - role       = "demo_companies_count_by_size_lambda_exec_role" -> null
    }

  # module.policy.aws_iam_role_policy_attachment.companies_count_by_size_lambda_vpc will be destroyed
  - resource "aws_iam_role_policy_attachment" "companies_count_by_size_lambda_vpc" {
      - id         = "demo_companies_count_by_size_lambda_exec_role-20211203145958636500000002" -> null
      - policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function" -> null
      - role       = "demo_companies_count_by_size_lambda_exec_role" -> null
    }

  # module.policy.aws_iam_role_policy_attachment.companies_kpi_average_lambda_logs will be destroyed
  - resource "aws_iam_role_policy_attachment" "companies_kpi_average_lambda_logs" {
      - id         = "demo_companies_kpi_average_lambda_exec_role-20211203145959763300000004" -> null
      - policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function" -> null
      - role       = "demo_companies_kpi_average_lambda_exec_role" -> null
    }

  # module.policy.aws_iam_role_policy_attachment.companies_kpi_average_lambda_vpc will be destroyed
  - resource "aws_iam_role_policy_attachment" "companies_kpi_average_lambda_vpc" {
      - id         = "demo_companies_kpi_average_lambda_exec_role-20211203145959698700000003" -> null
      - policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function" -> null
      - role       = "demo_companies_kpi_average_lambda_exec_role" -> null
    }

  # module.policy.aws_iam_role_policy_attachment.get_growth_and_margin_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "get_growth_and_margin_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function"
      + role       = "demo_get_growth_and_margin_id_lambda_exec_role"
    }

  # module.policy.aws_iam_role_policy_attachment.get_growth_and_margin_lambda_vpc will be created
  + resource "aws_iam_role_policy_attachment" "get_growth_and_margin_lambda_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function"
      + role       = "demo_get_growth_and_margin_id_lambda_exec_role"
    }

  # module.policy.aws_lambda_permission.apigw_get_companies_count_by_size_lambda will be destroyed
  - resource "aws_lambda_permission" "apigw_get_companies_count_by_size_lambda" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "demo_get_companies_count_by_size_lambda_function" -> null
      - id            = "AllowExecutionFromAPIGateway" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - qualifier     = "" -> null
      - source_arn    = (sensitive) -> null
      - statement_id  = "AllowExecutionFromAPIGateway" -> null
    }

  # module.policy.aws_lambda_permission.apigw_get_companies_kpi_average_lambda will be destroyed
  - resource "aws_lambda_permission" "apigw_get_companies_kpi_average_lambda" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "demo_get_companies_kpi_average_lambda_function" -> null
      - id            = "AllowExecutionFromAPIGateway" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - qualifier     = "" -> null
      - source_arn    = (sensitive) -> null
      - statement_id  = "AllowExecutionFromAPIGateway" -> null
    }

  # module.policy.aws_lambda_permission.apigw_get_growth_and_margin_lambda will be created
  + resource "aws_lambda_permission" "apigw_get_growth_and_margin_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "demo_get_growth_and_margin_lambda_function"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (sensitive)
      + statement_id  = "AllowExecutionFromAPIGatewayGrowthAndMargin"
    }

Plan: 11 to add, 33 to change, 21 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*